# 练习题1
'''
------------猜年龄游戏 start-------------
猜年龄游戏
10  猜的太小了
29  猜的太大了，灰姑娘有这么老吗？往小的试试
18  恭喜猜对了， 灰姑娘永远18岁！
------------  end ----------------------
'''

while True:
    print("------------猜年龄游戏 start-------------")
    str = input('请输入你要猜得年龄:')
    if str.isdigit():
        num = int(str)
        if 1 < num < 500:
            if num <= 17:
                print(f'你输入的年龄为:{num},猜的太小了')
            elif num >= 19:
                print(f"你输入的年龄为:{num},你是傻子嘛,灰姑娘有这么老吗？在往小的试试")
            elif num == 18:
                print(f"你输入的年龄为:{num},恭喜你猜对了， 灰姑娘永远18岁！")
                print("------------  end ----------------------")
                break
        else:
            print('请输入正确的年龄段,年龄不能小于1 ,大于500')
    else:
        print('请输入数字，请重新输入！')

# 练习题2
'''
    写一段程序，读取用户输入的工资 
    根据工资的多少，打印出你工作的心态
    月薪1000：老板，我是你爸爸！
    月薪2000：老板，可怜可怜我吧
    月薪5000：老板脑子有坑，背后说我坏话
    月薪10000：老板说的有点对 ，但是我不说话
    月薪20000：老板说什么都对，只要给钱就行
    月薪30000：老板说什么都对，如果有人错了 那一定就是我
    月薪50000: 996就像呼吸一样自然
    月薪100000：公司就是我家  我愿意每天住公司
'''
while True:
    print('请输入你的薪资，并且必须是数字，如果不想玩了请输入000')
    print("=================开始==================")
    salarys = input('请输入你的薪资：')
    if salarys.isdigit():
        salary = float(salarys)
        if 0 < salary < 1000:
            print(f'月薪{salary}：老板，我是你爸爸！')
        elif 1000 <= salary < 5000:
            print(f'月薪{salary}：老板，可怜可怜我吧')
        elif 5000 <= salary < 10000:
            print(f'月薪{salary}：老板脑子有坑，背后说我坏话')
        elif 10000 <= salary < 20000:
            print(f'月薪{salary}：老板说的有点对 ，但是我不说话')
        elif 20000 <= salary < 50000:
            print(f"月薪{salary}：老板说什么都对，只要给钱就行")
        elif 50000 <= salary < 100000:
            print(f"月薪{salary}: 996就像呼吸一样自然")
        elif salary >= 100000:
            print(f"月薪{salary}：公司就是我家  我愿意每天住公司")
        elif salary == 000:
            print('不想玩了 ，程序已退出')
            print("=================开始==================")
            break
    else:
        print('请输入正确的薪资！')
